app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" IS NULL LIMIT 1
---
  def new
    @answer = Answer.new
    @question = Question.find_by(id: params[:question_id])

INSERT INTO "answers" ("content", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "adsfafsdasdadsfafsd"], ["question_id", 1], ["created_at", "2015-02-27 16:02:10.434420"], ["updated_at", "2015-02-27 16:02:10.434420"]]
---
  def create
    @answer = Answer.new(answer_params)
    if @answer.save